app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "ooooooooooo"], ["description", "kkkkkkkkk"], ["price", 222222222222.0], ["created_at", "2022-03-16 07:20:18.550664"], ["updated_at", "2022-03-16 07:20:18.550664"], ["user_id", 1]]
UPDATE "products" SET "updated_at" = ? WHERE "products"."id" = ?  [["updated_at", "2022-03-16 06:18:43.737883"], ["id", 8]]
---
  def create
    @product = Product.create(product_params)

    respond_to do |format|
      if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "alienware test description -edited"], ["updated_at", "2022-03-15 08:05:34.368604"], ["id", 4]]
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update(product_params)